micronaut-benchmark-app/benchmark-test/ab-100-concurrent-delay-100
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /latency?delay=100
Document Length:        41 bytes

Concurrency Level:      100
Time taken for tests:   8.835 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      150000 bytes
HTML transferred:       41000 bytes
Requests per second:    113.19 [#/sec] (mean)
Time per request:       883.494 [ms] (mean)
Time per request:       8.835 [ms] (mean, across all concurrent requests)
Transfer rate:          16.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.9      1       5
Processing:   102  826 142.3    835     950
Waiting:      102  825 142.3    834     949
Total:        106  827 141.5    836     951

Percentage of the requests served within a certain time (ms)
  50%    836
  66%    871
  75%    900
  80%    918
  90%    931
  95%    937
  98%    941
  99%    943
 100%    951 (longest request)