micronaut-benchmark-app/benchmark-test/ab-100-concurrent-delay-500
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /latency?delay=500
Document Length:        41 bytes

Concurrency Level:      100
Time taken for tests:   42.815 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      150000 bytes
HTML transferred:       41000 bytes
Requests per second:    23.36 [#/sec] (mean)
Time per request:       4281.471 [ms] (mean)
Time per request:       42.815 [ms] (mean, across all concurrent requests)
Transfer rate:          3.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.1      1       7
Processing:   501 4008 718.3   4031    4543
Waiting:      501 4007 718.3   4030    4543
Total:        507 4009 717.4   4033    4544

Percentage of the requests served within a certain time (ms)
  50%   4033
  66%   4037
  75%   4527
  80%   4531
  90%   4535
  95%   4537
  98%   4539
  99%   4540
 100%   4544 (longest request)