micronaut-benchmark-app/benchmark-test/ab-1000-concurrent-delay-100
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /latency?delay=100
Document Length:        41 bytes

Concurrency Level:      1000
Time taken for tests:   86.584 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1500000 bytes
HTML transferred:       410000 bytes
Requests per second:    115.49 [#/sec] (mean)
Time per request:       8658.397 [ms] (mean)
Time per request:       8.658 [ms] (mean, across all concurrent requests)
Transfer rate:          16.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    8  18.1      3      92
Processing:   108 8195 1499.2   8605    8807
Waiting:      104 8193 1499.2   8603    8804
Total:        196 8203 1481.5   8609    8810

Percentage of the requests served within a certain time (ms)
  50%   8609
  66%   8635
  75%   8656
  80%   8670
  90%   8689
  95%   8707
  98%   8727
  99%   8738
 100%   8810 (longest request)