micronaut-benchmark-app/benchmark-test/ab-500-concurrent-delay-100
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /latency?delay=100
Document Length:        41 bytes

Concurrency Level:      500
Time taken for tests:   43.518 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      750000 bytes
HTML transferred:       205000 bytes
Requests per second:    114.90 [#/sec] (mean)
Time per request:       4351.779 [ms] (mean)
Time per request:       8.704 [ms] (mean, across all concurrent requests)
Transfer rate:          16.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   12  29.4      2     154
Processing:   101 4107 748.2   4337    4644
Waiting:      100 4106 748.5   4335    4644
Total:        251 4119 719.7   4339    4649

Percentage of the requests served within a certain time (ms)
  50%   4339
  66%   4353
  75%   4359
  80%   4363
  90%   4373
  95%   4378
  98%   4387
  99%   4408
 100%   4649 (longest request)